<a href="https://colab.research.google.com/github/atif4/Q2/blob/gh-pages/astronauts.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#hide earrings 
import warnings
warnings.filterwarnings('ignore')
import pandas as pd
import numpy as np

In [41]:

from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

In [2]:
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
plt.style.use('seaborn')

In [3]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import MinMaxScaler

In [4]:
"""from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense"""
from tensorflow.keras.optimizers import Adam, SGD
from keras import regularizers
from keras import layers
from tensorflow.keras import models

In [5]:
df = pd.read_csv("/content/drive/MyDrive/Dataset/astronauts.csv")
df.head(3)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN
1,Loren W. Acton,NaN,NaN,Retired,3/7/1936,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaN,NaN
2,James C. Adamson,1984.0,10.0,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN

In [6]:
df.rename(columns={'Birth Date':'Birth_Date', 'Birth Place':'Birth_Place','Alma Mater':'Alma_Mater', 'Undergraduate Major':'Undergraduate_Major', 'Graduate Major':'Graduate_Major',
       'Military Rank':'Military_Rank', 'Military Branch':'Military_Branch', 'Space Flights':'Space_Flights',
       'Space Flight (hr)':'Space_Flight_(hr)', 'Space Walks':'Space_Walks', 'Space Walks (hr)':'Space_Walks_(hr)',
       'Death Date':'Death_Date', 'Death Mission':'Death_Mission'},inplace=True)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 357 entries, 0 to 356
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Name                 357 non-null    object
 1   Year                 330 non-null    float64
 2   Group                330 non-null    float64
 3   Status               357 non-null    object
 4   Birth_Date           357 non-null    object
 5   Birth_Place          357 non-null    object
 6   Gender               357 non-null    object
 7   Alma_Mater           356 non-null    object
 8   Undergraduate_Major  335 non-null    object
 9   Graduate_Major       298 non-null    object
 10  Military_Rank        207 non-null    object
 11  Military_Branch      211 non-null    object
 12  Space_Flights        357 non-null    int64
 13  Space_Flight_(hr)    357 non-null    int64
 14  Space_Walks          357 non-null    int64
 15  Space_Walks_(hr)     357 non-null    float64
 16  Missions             334 non-null    object
 17  Death_Date           52 non-null     object
 18  Death_Mission        16 non-null     object
dtypes: float64(3), int64(3), object(13)
memory usage: 53.1+ KB

In [8]:
df['Death_Date']=df['Death_Date'].astype('datetime64[ns]')
df['Birth_Date']=df['Birth_Date'].astype('datetime64[ns]')

In [9]:
def get_each_dtpyes(col_list):
    ob = []
    integer = []
    fl = []
    data_time = []
    bol = []
    for i in col_list:
        if df[i].dtypes == 'object':
            ob.append(i)
        if df[i].dtypes == 'int64':
            integer.append(i)
        if  df[i].dtypes == 'float64':
            fl.append(i)
        if df[i].dtypes == 'datetime64[ns]':
            data_time.append(i)
        if df[i].dtypes == "bool":
            bol.append(i)
    return print(f"list of object dtpyes:\n{ob}\n{len(ob)}\n\nlist of integers dtypes:\n{integer}\n{len(integer)}\n\nlist of float dtypes:\n{fl}\n{len(fl)}\n\nlist of datatime dtype:\n{data_time}\n{len(data_time)}\nlist of datatime dtype:\n{bol}\n{len(bol)}\n")
get_each_dtpyes(['Name', 'Year', 'Group', 'Status', 'Birth_Date', 'Birth_Place','Gender', 'Alma_Mater', 'Undergraduate_Major', 'Graduate_Major',
       'Military_Rank', 'Military_Branch', 'Space_Flights','Space_Flight_(hr)', 'Space_Walks', 'Space_Walks_(hr)', 'Missions','Death_Date', 'Death_Mission'])

list of object dtpyes:
['Name', 'Status', 'Birth_Place', 'Gender', 'Alma_Mater', 'Undergraduate_Major', 'Graduate_Major', 'Military_Rank', 'Military_Branch', 'Missions', 'Death_Mission']
11

list of integers dtypes:
['Space_Flights', 'Space_Flight_(hr)', 'Space_Walks']
3

list of float dtypes:
['Year', 'Group', 'Space_Walks_(hr)']
3

list of datatime dtype:
['Birth_Date', 'Death_Date']
2
list of datatime dtype:
[]
0

In [10]:
null_value = {}
not_null_value = {}
def get_null_value_col(list_col):
  for i in list_col:
    if df[i].isnull().sum() == 0:
      not_null_value[i]=df[i].isnull().sum()
    else:
      null_value[i]=df[i].isnull().sum()
get_null_value_col(['Name', 'Year', 'Group', 'Status', 'Birth_Date', 'Birth_Place', 'Gender', 'Alma_Mater', 'Undergraduate_Major', 'Graduate_Major',
       'Military_Rank', 'Military_Branch', 'Space_Flights','Space_Flight_(hr)', 'Space_Walks', 'Space_Walks_(hr)', 'Missions', 'Death_Date', 'Death_Mission'])

In [11]:
display("This is list of columns which has null values: ",null_value)
display("The number of columns which has null value are  ",len(null_value))
#display("This is list of columns which does not have null values: ",not_null_value)
#display("This is lenght of list which does not have null value: ",len(not_null_value))

'This is list of columns which has null values: '

{'Year': 27,
 'Group': 27,
 'Alma_Mater': 1,
 'Undergraduate_Major': 22,
 'Graduate_Major': 59,
 'Military_Rank': 150,
 'Military_Branch': 146,
 'Missions': 23,
 'Death_Date': 305,
 'Death_Mission': 341}

'The number of columns which has null value are  '

10

In [12]:
null_value.keys()

dict_keys(['Year', 'Group', 'Alma_Mater', 'Undergraduate_Major', 'Graduate_Major', 'Military_Rank', 'Military_Branch', 'Missions', 'Death_Date', 'Death_Mission'])

In [13]:
update_col_dic={}
drop_col_dic ={}
def get_percentage_of_each_col(list_col):
  for i in list_col:
    if df[i].isnull().sum()/len(df)*100 > 30:
      update_col_dic[i] = df[i].isnull().sum()/len(df)*100
    else:
      drop_col_dic[i]=df[i].isnull().sum()/len(df)*100 
get_percentage_of_each_col(['Year', 'Group', 'Alma_Mater', 'Undergraduate_Major', 'Graduate_Major', 'Military_Rank', 'Military_Branch', 'Missions', 'Death_Date', 'Death_Mission'])

In [14]:
display("These percentages are greater then 30 you have to use techniques to fill the missing values of following columns: ", update_col_dic)

'The percentages are greater then 30 you use techniques to fill the value for following columns: '

{'Military_Rank': 42.016806722689076,
 'Military_Branch': 40.896358543417364,
 'Death_Date': 85.43417366946778,
 'Death_Mission': 95.51820728291317}

In [15]:
display("These percentages are not greater then 30 you have to drop the following columns: ",drop_col_dic)

'The percentages are not greater then 30 you have to drop the following columns: '

{'Year': 7.563025210084033,
 'Group': 7.563025210084033,
 'Alma_Mater': 0.2801120448179272,
 'Undergraduate_Major': 6.162464985994398,
 'Graduate_Major': 16.5266106442577,
 'Missions': 6.442577030812324}

In [16]:
drop_col_dic.keys()

dict_keys(['Year', 'Group', 'Alma_Mater', 'Undergraduate_Major', 'Graduate_Major', 'Missions'])

In [17]:
df.drop(['Year', 'Group', 'Alma_Mater', 'Undergraduate_Major', 'Graduate_Major', 'Missions'],axis=1,inplace=True)

In [18]:
df.head(2)

,Name,Status,Birth_Date,Birth_Place,Gender,Military_Rank,Military_Branch,Space_Flights,Space_Flight_(hr),Space_Walks,Space_Walks_(hr),Death_Date,Death_Mission
0,Joseph M. Acaba,Active,1967-05-17,"Inglewood, CA",Male,NaN,NaN,2,3307,2,13.0,NaT,NaN
1,Loren W. Acton,Retired,1936-03-07,"Lewiston, MT",Male,NaN,NaN,1,190,0,0.0,NaT,NaN

In [19]:
update_col_dic.keys()

dict_keys(['Military_Rank', 'Military_Branch', 'Death_Date', 'Death_Mission'])

In [20]:
dict_of_mode_values = {}
def get_mode_value_to_fill_na_values(col_list):
    for i in col_list:
        dict_of_mode_values[i] = df[i].mode()
get_mode_value_to_fill_na_values(['Military_Rank', 'Military_Branch', 'Death_Date', 'Death_Mission'])

In [21]:
dict_of_mode_values

{'Military_Rank': 0    Colonel
 dtype: object, 'Military_Branch': 0    US Air Force (Retired)
 dtype: object, 'Death_Date': 0   1986-01-28
 dtype: datetime64[ns], 'Death_Mission': 0    STS 51-L (Challenger)
 dtype: object}

In [22]:
df["Military_Rank"].fillna("Colonel", inplace = True)
df["Death_Mission"].fillna("STS 51-L (Challenger)", inplace = True)
df["Military_Branch"].fillna("US Air Force (Retired)", inplace = True)
df["Death_Date"].fillna("1986-01-28", inplace=True)

In [23]:
"""def get_fill(list_of_col_id):
  for i in list_of_col_id:
    df[i].fillna(df[i].mode(), inplace = True)"""

'def get_fill(list_of_col_id):\n  for i in list_of_col_id:\n    df[i].fillna(df[i].mode(), inplace = True)'

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 357 entries, 0 to 356
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               357 non-null    object
 1   Status             357 non-null    object
 2   Birth_Date         357 non-null    datetime64[ns]
 3   Birth_Place        357 non-null    object
 4   Gender             357 non-null    object
 5   Military_Rank      357 non-null    object
 6   Military_Branch    357 non-null    object
 7   Space_Flights      357 non-null    int64
 8   Space_Flight_(hr)  357 non-null    int64
 9   Space_Walks        357 non-null    int64
 10  Space_Walks_(hr)   357 non-null    float64
 11  Death_Date         357 non-null    datetime64[ns]
 12  Death_Mission      357 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(3), object(7)
memory usage: 36.4+ KB

In [28]:
df.head(1)

,Name,Status,Birth_Date,Birth_Place,Gender,Military_Rank,Military_Branch,Space_Flights,Space_Flight_(hr),Space_Walks,Space_Walks_(hr),Death_Date,Death_Mission
0,Joseph M. Acaba,Active,1967-05-17,"Inglewood, CA",Male,Colonel,US Air Force (Retired),2,3307,2,13.0,1986-01-28,STS 51-L (Challenger)

In [26]:
df.to_csv('/content/drive/MyDrive/Dataset/astronauts_ready_for_viz.csv', index=False)

In [38]:
def get_labed_encoder(col_ids_list):
    for col_id_list in col_ids_list:
        df[col_id_list] = df[col_id_list].apply(LabelEncoder().fit_transform)
get_labed_encoder([['Name', 'Status', 'Birth_Place', 'Gender', 'Military_Rank', 'Military_Branch', 'Death_Mission']])
df.head(3)

,Name,Status,Birth_Date,Birth_Place,Gender,Military_Rank,Military_Branch,Space_Flights,Space_Flight_(hr),Space_Walks,Space_Walks_(hr),Death_Date,Death_Mission
0,167,0,1967-05-17,115,1,3,1,2,3307,2,13.0,1986-01-28,1
1,203,3,1936-03-07,135,1,3,1,1,190,0,0.0,1986-01-28,1
2,127,3,1946-03-03,259,1,3,5,2,334,0,0.0,1986-01-28,1